import css from './Services.module.css';

export const Services = () => {
  return (
    <section className={css.servicesSection} id="services-link">
      <div className={css.container}>
        <h2 className={css.sectionTitle}>Основні послуги шкільної бібліотеки</h2>
        <ol className={css.servicesList}>
          <li className={css.serviceItem}>
            <h3>Видача навчальної та художньої літератури</h3>
            <ul>
              <li>Забезпечення учнів та вчителів підручниками та додатковою навчальною літературою.</li>
              <li>Видача художніх книг, довідників, енциклопедій тощо.</li>
            </ul>
          </li>
          <li className={css.serviceItem}>
            <h3>Доступ до електронних ресурсів</h3>
            <ul>
              <li>Надання доступу до цифрових навчальних матеріалів, електронних підручників та освітніх платформ.</li>
              <li>Консультації щодо використання інтернет-ресурсів у навчанні.</li>
            </ul>
          </li>
          <li className={css.serviceItem}>
            <h3>Індивідуальні консультації та рекомендації</h3>
            <ul>
              <li>Допомога у підборі літератури за темою, інтересами чи навчальною потребою.</li>
              <li>Надання інформаційних довідок, тематичних списків літератури.</li>
            </ul>
          </li>
          <li className={css.serviceItem}>
            <h3>Організація виставок і заходів</h3>
            <ul>
              <li>Тематичні книжкові виставки, огляди новинок, літературні години, конкурси та вікторини.</li>
              <li>Проведення заходів, присвячених визначним датам, письменникам та культурним подіям.</li>
            </ul>
          </li>
          <li className={css.serviceItem}>
            <h3>Популяризація читання</h3>
            <ul>
              <li>Заохочення до читання через участь у різних заходах.</li>
              <li>Робота з молодшими школярами з формування читацьких навичок.</li>
            </ul>
          </li>
          <li className={css.serviceItem}>
            <h3>Методична підтримка вчителів</h3>
            <ul>
              <li>Забезпечення педагогів методичною літературою, посібниками та рекомендаціями.</li>
              <li>Допомога у підготовці до уроків, заходів та виховної роботи.</li>
            </ul>
          </li>
        </ol>
      </div>
    </section>
  );
};
