import css from './Directions.module.css';

export const Directions = () => {
  return (
    <section className={css.directionsSection} id="directions-link">
      <div className={css.container}>
        <h2 className={css.sectionTitle}>Основні напрями роботи шкільної бібліотеки</h2>
        <ol className={css.directionsList}>
          <li className={css.directionItem}>
            <h3>Інформаційне забезпечення освітнього процесу</h3>
            <ul>
              <li>Надання учням і педагогам доступу до навчальної, довідкової та художньої літератури.</li>
              <li>Формування та оновлення книжкового фонду відповідно до потреб навчального плану.</li>
            </ul>
          </li>
          <li className={css.directionItem}>
            <h3>Підтримка читання та розвиток читацької культури</h3>
            <ul>
              <li>Організація книжкових виставок, літературних заходів, конкурсів, оглядів новинок.</li>
              <li>Індивідуальна робота з читачами щодо підбору літератури за інтересами.</li>
            </ul>
          </li>
          <li className={css.directionItem}>
            <h3>Інформаційно-бібліографічна діяльність</h3>
            <ul>
              <li>Ознайомлення користувачів з правилами користування бібліотекою та навичками пошуку інформації.</li>
              <li>Створення інформаційних бюлетенів, рекомендаційних списків літератури, бібліографічних довідок.</li>
            </ul>
          </li>
          <li className={css.directionItem}>
            <h3>Виховна робота</h3>
            <ul>
              <li>Участь у реалізації виховних програм школи.</li>
              <li>Проведення тематичних заходів, приурочених до пам’ятних та визначних дат.</li>
            </ul>
          </li>
          <li className={css.directionItem}>
            <h3>Популяризація української книги та національних цінностей</h3>
            <ul>
              <li>Знайомство з творами українських авторів, національно-патріотичне виховання через літературу.</li>
              <li>Підтримка інтересу до історії, культури та традицій українського народу.</li>
            </ul>
          </li>
          <li className={css.directionItem}>
            <h3>Партнерство та співпраця</h3>
            <ul>
              <li>Взаємодія з вчителями, батьками, громадськими організаціями та іншими бібліотеками.</li>
              <li>Спільна участь у проектах, акціях, ініціативах, спрямованих на розвиток шкільного читання.</li>
            </ul>
          </li>
        </ol>
      </div>
    </section>
  );
};
